# Install zsh
brew 'zsh'

brew 'wget'
brew 'openssl'
brew 'git'
brew 'git-flow'
brew 'tig'
brew 'tree'
brew 'jq'
brew 'plenv'
brew 'rbenv'
brew 'goenv'
brew 'readline'
brew 'ag'
brew 'pt'
brew 'tmux'
brew 'peco'

# for nokogiri
brew 'libxml2'
brew 'libxslt'
brew 'libiconv'

brew 'universal-ctags', args: ['HEAD']

# vim
brew 'vim'

tap 'sanemat/font'
brew 'ricty', args: ['with-powerline']
